+ Просмотры топиков сейчас
+like
+иконку курсор
+пагинация
+назвнание темы в url
+helper вреени

подсказки
+мобильная версия отображения постов

Аватары плагин
+ответ на посты/цитирование

+роли пользователей, доступы
+перемещение тем
+редактирование тем
+редактирование поста
+модерация поста
+aside -вынести в метод
+оторажение разделов
+отображение форумов
+отображение тем
+отображение постов
+проверка при публикации тем
+проверка при публикации постов
+удаление постов (кроме первого в теме)


+кабинет модератора
+баны

+Стажеры баны не более 24ч=1день
+Баны можно отменить только по должности ниже сотрудника и свой
+Админ форума - доступы -> стажер и модер форума
+Зам главы сената -> стажер и модер форума, стажер, модер и следователь сената
+Глава -> стажер и модер форума, стажер, модер, следователь, советник, зам.главы
+Проверку на бан самому себе
+нельзя отменить бан самому себе
+нельзя изменить роль самому себе
+кастомные доступы только админы 11-12

+кастомные модеры не видят скрытые и премод посты
если в теме нет постов (скрыты) не возможно поредачить тему
+у кастомного доступа модер - нет кнопок галочек темы при редактировании
рейтинг пользователя, если отрицательный поменять значек

+редактирование доступов
пожаловаться на пост

+сообщения на форуе (написать, прочитать)
+удаление сообщений (hide)
пометить как прочитанное/не-
+блок/разблок сообщений

+кабинет пользователя
+измнение аватара
+удаление аватара +для модеров role>8 & =4
удаление аватара последние ответы???


картинки
+ограничение на 2мб !!!!
+ограничение в день 10 мб - до 3 ур // пока 20мб
+удаление картинок при удалении постов
удаление картинок без ид поста по крону

сделать культурнее отображение лимита на загрузку куртинок
+запрет на пм самому себе

// Главная
+новостная лента
+новые топики
+последние апнутые
? просматриваемые за неделю
? апнутые за неделю

газеты и комментарии
лайки комментариев
+счетчики комментариев
фильтр по новостям внутри газеты
фильтр новостей по всем газетам
редактирование комментов
пагинация комментов
регистрация газет (газета+ветка)
главред +/-
журналисты +/-
отображение инфы о газетах

+клановые форумы
создание клановых форумов

?? баны для газет и клан форумов модеров


+авторизация на форум

/////
+ хтмл теги запускаются
 zero width space и их подобия

 app.css не заливается

 скрытые темы для клановых форумов
 переделать сообщения
 поиск по форуму

 проверка на флуд на служебном форуме

