+ Просмотры топиков сейчас

+like
+иконку курсор
подсказки

мобильная версия отображения постов

пагинация
+назвнание темы в url
+helper вреени
Аватары плагин

ответ на посты/цитирование

роли пользователей, доступы
кабинет модератора
баны
редактирование доступов
пожаловаться на пост

сообщения на форуе (написать, прочитать)

кабинет пользователя
измнение аватара
редактирование подписи

// Главная
новостная лента
новые топики
последние апнутые
? просматриваемые за неделю
? апнутые за неделю

авторизация на форум
