+ Просмотры топиков сейчас
+like
+иконку курсор
+пагинация
+назвнание темы в url
+helper вреени

подсказки
мобильная версия отображения постов

Аватары плагин
+ответ на посты/цитирование

роли пользователей, доступы
+перемещение тем
+редактирование тем
+редактирование поста
+модерация поста
+aside -вынести в метод
+оторажение разделов
+отображение форумов
+отображение тем
+отображение постов
+проверка при публикации тем
+проверка при публикации постов
удаление постов (кроме первого в теме)
удаление тем


+кабинет модератора
+баны

+Стажеры баны не более 24ч=1день
+Баны можно отменить только по должности ниже сотрудника и свой
+Админ форума - доступы -> стажер и модер форума
+Зам главы сената -> стажер и модер форума, стажер, модер и следователь сената
+Глава -> стажер и модер форума, стажер, модер, следователь, советник, зам.главы
+Проверку на бан самому себе
+нельзя отменить бан самому себе
+нельзя изменить роль самому себе
+кастомные доступы только админы 11-12

+кастомные модеры не видят скрытые и премод посты
если в теме нет постов (скрыты) не возможно поредачить тему
+у кастомного доступа модер - нет кнопок галочек темы при редактировании
рейтинг пользователя, если отрицательный поменять значек

+редактирование доступов
пожаловаться на пост

сообщения на форуе (написать, прочитать)

+кабинет пользователя
измнение аватара
удаление аватара +для модеров role>7 & =4

картинки
ограничение на 2мб !!!!
ограничение в день 10 мб - до 3 ур
с 3 ур 20мб

// Главная
новостная лента
новые топики
последние апнутые
? просматриваемые за неделю
? апнутые за неделю

газеты и комментарии

авторизация на форум
